Revit 2027 API
FilledRegion.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, IList<CurveLoop>) |  Creates a view-specific filled region from the given boundaries.
Create(Document, ElementId, SketchPlane, IList<CurveLoop>) |  Creates a filled region on a sketch plane in a 3d model family.
Top
See Also
Reference
FilledRegion Class
Autodesk.Revit.DB Namespace